dowhile98/STM32_FromScratch/JUNIO-2023/SysTick/Core/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/*Includes ----------------------------------------------------*/
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include "stm32f4xx.h"
#include "core_cm4.h"
#include "SysTick.h"
#include "HD44780.h"
#include "GPIO.h"
/*Typedef -----------------------------------------------------*/

/*Defines -----------------------------------------------------*/

/*Global variables --------------------------------------------*/

/*Function prototype ------------------------------------------*/
int __io_putchar(int ch){
	//salida
	ITM_SendChar(ch);

	return ch;
}
/*main function -----------------------------------------------*/
int main(void)
{
	uint32_t ticks;
	GPIO_ConfigTypedef_t lcdPin;
	//PD12->salida
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
	GPIOD->MODER &=~ GPIO_MODER_MODE12;
	GPIOD->MODER |= GPIO_MODER_MODE12_0;
	/**
	 * ticks = 16MHz * 0.001
	 * ticks = 16000
	 */
	ticks = 16000;
	SysTick_Init(ticks);

	ticks = GetTicks();

	/*Lcd init -----------------------------------*/
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
	lcdPin.pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6;
	lcdPin.mode = GPIO_MODE_OUTPUT;
	lcdPin.pullup = GPIO_PU_NONE;
	lcdPin.speed = GPIO_SPEED_HIGH;
	lcdPin.outputType = GPIO_OT_PP;
	BSP_PinInit(GPIOA, &lcdPin);

	LCD_Init(16, 2);

	LCD_Printf(0, 0, "hola mundo\r\nQUINO B.Jeffry");
    /* Loop forever */
	for(;;){
		//leer adc
		if((GetTicks() - ticks)>= 100){
			ticks = GetTicks();
			GPIOD->ODR ^= GPIO_ODR_OD12;
		}
		//mostar en la pantalla contenido


		//lectora de botones



	}
}
/*Function definition -----------------------------------------*/


